УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_НастройкиУниверсальнойВыгрузкиДанных/УПЖКХ_НастройкиУниверсальнойВыгрузкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УПЖКХ_НастройкиУниверсальнойВыгрузкиДанных</name>
  <attributes>
    <name>ВыборЛицевыхСчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыборУслуг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТолькоСНомерамиТелефонов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяСуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоОтветственномуСобственнику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыгрузкиДанныхПоПоказаниямСчетчиков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтбораПоСуммеДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыбранныеЛицевыеСчета</name>
    <attributes>
      <name>ЛицевойСчет</name>
      <type>
        <types>CatalogRef.КВП_ЛицевыеСчета</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыбранныеУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.КВП_Услуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_НастройкиУниверсальнойВыгрузкиДанных/ObjectModule.bsl
#Область ОбработчикиСобытияСправочника

// Служит для проверки пустых строк ТЧ "ВыбранныеЛицевыеСчета" и "ВыбранныеУслуги".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Производится проверка в том случае, когда выгружаются данные не по всем лицевым счетам,
	// т.е не выбрана настройка ВыборЛицевыхСчетов: "Всем лицевым счетам".
	Если ВыборЛицевыхСчетов <> 0 Тогда
		
		ПроверяемыеРеквизиты.Добавить("ВыбранныеЛицевыеСчета");
		
		Если ВыбранныеЛицевыеСчета.Количество() > 0 Тогда
			
			Отбор = Новый Структура("ЛицевойСчет", Справочники.КВП_ЛицевыеСчета.ПустаяСсылка());
			
			Если НЕ ВыбранныеЛицевыеСчета.НайтиСтроки(Отбор).Количество() = 0 Тогда
				УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьПользователю("В списке выбранных лицевых счетов имеются пустые строки!",,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Производится проверка в том случае, когда выгружаются данные не по всем услугам,
	// т.е не выбрана настройка ВыборУслуг: "Всем услугам".
	Если ВыборУслуг <> 0 Тогда
		
		ПроверяемыеРеквизиты.Добавить("ВыбранныеУслуги");
		
		Если ВыбранныеУслуги.Количество() > 0 Тогда
			
			Отбор = Новый Структура("Услуга", Справочники.КВП_Услуги.ПустаяСсылка());
			
			Если НЕ ВыбранныеУслуги.НайтиСтроки(Отбор).Количество() = 0 Тогда
				УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьПользователю("В списке выбранных услуг имеются пустые строки!",,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
